 
                             Library Compiler (TM)
                                 DesignWare (R)

             Version U-2022.12-SP6 for linux64 - Aug 08, 2023 -SLE

                    Copyright (c) 1988 - 2023 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)

Initializing...
lc_shell> set target_library "path/to/RF1SHD_tt_1p2v_25c_syn.lib"
path/to/RF1SHD_tt_1p2v_25c_syn.lib
lc_shell> set target_library "/user/stud/fall23/rf2715/CSEE-4823-project/mem_comp/RF1SHD_tt_1p2v_25c_syn.lib"
/user/stud/fall23/rf2715/CSEE-4823-project/mem_comp/RF1SHD_tt_1p2v_25c_syn.lib
lc_shell> write_lib -format db -output RF1SHD_tt_1p2v_25c_syn.db
Error: Required argument 'library_name' was not found (CMD-007)
lc_shell> set target_library "/user/stud/fall23/rf2715/CSEE-4823-project/mem_comp/RF1SHD_tt_1p2v_25c_syn.lib"
/user/stud/fall23/rf2715/CSEE-4823-project/mem_comp/RF1SHD_tt_1p2v_25c_syn.lib
lc_shell> read_lib "/user/stud/fall23/rf2715/CSEE-4823-project/mem_comp/RF1SHD_tt_1p2v_25c_syn.lib"
Reading '/user/stud/fall23/rf2715/CSEE-4823-project/mem_comp/RF1SHD_tt_1p2v_25c_syn.lib' ...
Warning: Line 58, The 'internal_power_calculation' attribute in char_config group is required for NLPM library. 
        No default can be applied to this attribute. (LBDB-366)
Information: Line 245, Cell 'RF1SHD', The cell 'RF1SHD' contiains memory/memory_read/memory_write groups which are deprecated, use the is_memory_cell attribute instead. (LIBG-280)
Technology library 'USERLIB' read successfully
1
lc_shell> write_lib -format db -output RF1SHD_tt_1p2v_25c_syn.db RF1SHD_tt_1p2v_25c_syn
Warning: The 'RF1SHD_tt_1p2v_25c_syn' library has not been read in yet. (UIL-3)
0
lc_shell> list_lib
-------------------------------------------------------------------------
Library File       Path
------- ----       ----
USERLIB USERLIB.db /homes/user/stud/fall23/rf2715/CSEE-4823-project/mem_comp
1
lc_shell> write_lib -format db -output RF1SHD_tt_1p2v_25c_syn.db USERLIB
Wrote the 'USERLIB' library to '/homes/user/stud/fall23/rf2715/CSEE-4823-project/mem_comp/RF1SHD_tt_1p2v_25c_syn.db' successfully
1
lc_shell> eixt
Error: unknown command 'eixt' (CMD-005)
lc_shell> clear
Error: unknown command 'clear' (CMD-005)
lc_shell> exit
Maximum memory usage for this session: 100.92 MB
CPU usage for this session:      0 seconds (  0.00 hours)
Elapsed time for this session:    370 seconds (  0.10 hours)
Thank you for using Library Compiler.

